app/views/doctors/new.html.erb

            <%# <%= label_tag(:specialty) %>
              <%= collection_select(:doctor, :specialty_id, Specialty.all, :id, :name, prompt: "Select Specialty", style: "width:100%") %><br>
---
SELECT "specialties".* FROM "specialties"

            <%# <%= label_tag(:Insurance) %>
            <%= collection_select(:doctor, :insurance_id, Insurance.all, :id, :name, prompt: "Select Insurance", style: "width:100%") %>
---
SELECT "insurances".* FROM "insurances"