app/controllers/application_controller.rb

    def current_patient
        @current_patient = Patient.find_by(id: session[:patient_id])
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]