app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 20]]
---
  def show
    @appointment = Appointment.find(params[:id])
    @appointment.destroy

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def edit
    @appointment = Appointment.find(params[:id])

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "appointments" SET "condition" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["condition", "Testing changes 2\r\n"], ["updated_at", "2019-10-04 16:34:34.471822"], ["id", 19]]
---
  def update
    @appointment = Appointment.find(params[:id])
    @appointment.update(set_params)

INSERT INTO "appointments" ("patient_id", "doctor_id", "date", "condition", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["patient_id", 14], ["doctor_id", 102], ["date", "2019-10-02"], ["condition", "headeach"], ["created_at", "2019-10-04 17:20:40.791560"], ["updated_at", "2019-10-04 17:20:40.791560"]]
---
  def create

    @appointment = Appointment.create(set_params)