app/controllers/doctors_controller.rb

  def find_doctor
    Doctor.find(params[:id])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 93], ["LIMIT", 1]]