app/controllers/patients_controller.rb

  def create
    if password_confirmation?
      @patient = Patient.create(set_patient_params)
---
INSERT INTO "patients" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if password_confirmation?
      @current_patient.update(set_patient_params)
---
UPDATE "patients" SET "first_name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "patients"."id" = $4  [["first_name", "Alex"], ["password_digest", "$2a$12$PCKiBfGZ.H2aZD2bI19E3uhtgiSuLU8j.Dcw9xmH34FTgNw5Czzy2"], ["updated_at", "2019-10-02 19:26:24.243547"], ["id", 6]]

  def destroy
    @current_patient.destroy
---
DELETE FROM "patients" WHERE "patients"."id" = $1  [["id", 6]]