app/controllers/sessions_controller.rb

  def verification
    @patient = Patient.find_by(email: params[:email])
---
SELECT "patients".* FROM "patients" WHERE "patients"."email" = $1 LIMIT $2  [["email", "email"], ["LIMIT", 1]]